##### Wide format --> a lot of columns
##### Long format --> a lot of rows

In [2]:
data=data.frame(
id=1:10,
sex=sample(c("male","female"),10,replace = T),
name=c("ram","hari","allah","eid","diwali","ronak","pooja","ganesh","akbar","aladin"),
chem=sample(40:100,10),
phy=sample(40:100,10),
maths=sample(40:100,10))

In [3]:
data

   id sex    name   chem phy maths
1   1 male   ram     42   64  80
2   2 male   hari    91   54  77
3   3 female allah   95   63  67
4   4 male   eid    100   94  97
5   5 female diwali  62   78 100
6   6 female ronak   65  100  54
7   7 male   pooja   85   53  68
8   8 male   ganesh  73   52  99
9   9 male   akbar   76   81  87
10 10 male   aladin  63   99  90

In [5]:
library("reshape2")

Warning message:
"package 'reshape2' was built under R version 3.6.1"

In [20]:
mdef=melt(data,id.vars=c("id","sex","name"),measure.vars = c("maths","phy","chem"),
    variable.name="subjects",value.name="marks")

In [21]:
mdef[sample(1:dim(mdef)[1],10),]

   id sex    name   subjects marks
18  8 male   ganesh phy      52
1   1 male   ram    maths    80
26  6 female ronak  chem     65
12  2 male   hari   phy      54
4   4 male   eid    maths    97
23  3 female allah  chem     95
28  8 male   ganesh chem     73
2   2 male   hari   maths    77
10 10 male   aladin maths    90
21  1 male   ram    chem     42

In [22]:
dim(data)

[1] 10  6

In [23]:
dim(mdef)

[1] 30  5

In [24]:
dcast(mdef,id+name~subjects,value.var="marks")

   id name   maths phy chem
1   1 ram     80    64  42
2   2 hari    77    54  91
3   3 allah   67    63  95
4   4 eid     97    94 100
5   5 diwali 100    78  62
6   6 ronak   54   100  65
7   7 pooja   68    53  85
8   8 ganesh  99    52  73
9   9 akbar   87    81  76
10 10 aladin  90    99  63

In [25]:
library(ggplot2)

In [38]:

df=mpg
df$id=1:234
head(df)

  manufacturer model displ year cyl trans      drv cty hwy fl class   id
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact 1
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact 2
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact 3
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact 4
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact 5
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact 6

In [40]:
mpg1=melt(df,id.vars=c("id","manufacturer","displ","cty","hwy"),measure.vars = c("trans","class","model"),
    variable.name="fucntion",value.name="newcal")

In [41]:
head(mpg1)

  id manufacturer displ cty hwy fucntion newcal
1 1  audi         1.8   18  29  trans    auto(l5)
2 2  audi         1.8   21  29  trans    manual(m5)
3 3  audi         2.0   20  31  trans    manual(m6)
4 4  audi         2.0   21  30  trans    auto(av)
5 5  audi         2.8   16  26  trans    auto(l5)
6 6  audi         2.8   18  26  trans    manual(m5)

In [43]:
x=dcast(mpg1,id+manufacturer+displ+cty+hwy~fucntion,value.var="newcal")

In [44]:
head(x)

  id manufacturer displ cty hwy trans      class   model
1 1  audi         1.8   18  29  auto(l5)   compact a4
2 2  audi         1.8   21  29  manual(m5) compact a4
3 3  audi         2.0   20  31  manual(m6) compact a4
4 4  audi         2.0   21  30  auto(av)   compact a4
5 5  audi         2.8   16  26  auto(l5)   compact a4
6 6  audi         2.8   18  26  manual(m5) compact a4

In [48]:
library("tidyr")

##### tidyr
* gather
* spread
* unite
* seperate

#### gather is equal to melt

In [47]:
gdf=gather(data,key="subjects",value="marks",c(4,5,6))
head(gdf)

  id sex    name   subjects marks
1 1  male   ram    chem      42
2 2  male   hari   chem      91
3 3  female allah  chem      95
4 4  male   eid    chem     100
5 5  female diwali chem      62
6 6  female ronak  chem      65

#### spread is equal to dcast

In [49]:
sdf=spread(gdf,key="subjects",value="marks")
head(sdf)

  id sex    name   chem maths phy
1 1  male   ram     42   80    64
2 2  male   hari    91   77    54
3 3  female allah   95   67    63
4 4  male   eid    100   97    94
5 5  female diwali  62  100    78
6 6  female ronak   65   54   100

In [62]:
gdf=gather(df,key="function",value="newcal",c(2,6,11))
gdf=gdf[,c("id","manufacturer","displ","cty","hwy","function","newcal")]
head(gdf)

  id manufacturer displ cty hwy function newcal
1 1  audi         1.8   18  29  model    a4
2 2  audi         1.8   21  29  model    a4
3 3  audi         2.0   20  31  model    a4
4 4  audi         2.0   21  30  model    a4
5 5  audi         2.8   16  26  model    a4
6 6  audi         2.8   18  26  model    a4

In [63]:
sdf=spread(gdf,key="function",value="newcal")
head(sdf)

  id manufacturer displ cty hwy class   model trans
1 1  audi         1.8   18  29  compact a4    auto(l5)
2 2  audi         1.8   21  29  compact a4    manual(m5)
3 3  audi         2.0   20  31  compact a4    manual(m6)
4 4  audi         2.0   21  30  compact a4    auto(av)
5 5  audi         2.8   16  26  compact a4    auto(l5)
6 6  audi         2.8   18  26  compact a4    manual(m5)

In [73]:
x=c("2019-08-01","2019-08-02","2019-08-03","2019-08-04","2019-08-05",
    "2019-08-06","2019-08-07","2019-08-08","2019-08-09","2019-08-10","2019-08-11","2019-08-12",
    "2018-08-01","2018-08-02","2018-08-03","2018-08-04","2018-08-05",
    "2018-08-06","2018-08-07","2018-08-08","2018-08-09","2018-08-10","2018-08-11","2018-08-12"
     )

In [76]:
date=as.Date("2019-08-24")
for(c in 1:24){
    date[c]=as.Date(x[c]);
    
}

In [77]:
date[1]

[1] "2019-08-01"

In [79]:
df=data.frame(
date=date,
A=sample(40:100,24),
B=sample(40:100,24),
C=sample(40:100,24),
product=sample(c("phone","referig","tv","laptop"),24,replace=T)
)

In [80]:
head(df)

  date       A  B  C  product
1 2019-08-01 57 68 98 phone
2 2019-08-02 73 91 68 referig
3 2019-08-03 51 45 56 tv
4 2019-08-04 42 71 81 referig
5 2019-08-05 79 95 53 laptop
6 2019-08-06 97 65 79 laptop

In [81]:
ndf=separate(df,col="date",into=c("year","month","day"),sep="-")

In [82]:
head(ndf)

  year month day A  B  C  product
1 2019 08    01  57 68 98 phone
2 2019 08    02  73 91 68 referig
3 2019 08    03  51 45 56 tv
4 2019 08    04  42 71 81 referig
5 2019 08    05  79 95 53 laptop
6 2019 08    06  97 65 79 laptop

In [83]:
udf=unite(ndf,col="date",c(1,2,3),sep="/")

In [84]:
head(udf)

  date       A  B  C  product
1 2019/08/01 57 68 98 phone
2 2019/08/02 73 91 68 referig
3 2019/08/03 51 45 56 tv
4 2019/08/04 42 71 81 referig
5 2019/08/05 79 95 53 laptop
6 2019/08/06 97 65 79 laptop

##### sqldf

In [106]:
library("sqldf")

In [107]:
head(data)

  id sex    name   chem phy maths
1 1  male   ram     42   64  80
2 2  male   hari    91   54  77
3 3  female allah   95   63  67
4 4  male   eid    100   94  97
5 5  female diwali  62   78 100
6 6  female ronak   65  100  54

In [110]:
d = data

In [111]:
sqldf("select name,phy,chem,maths from d")

   name   phy chem maths
1  ram     64  42   80
2  hari    54  91   77
3  allah   63  95   67
4  eid     94 100   97
5  diwali  78  62  100
6  ronak  100  65   54
7  pooja   53  85   68
8  ganesh  52  73   99
9  akbar   81  76   87
10 aladin  99  63   90

In [99]:
sqldf("select * from data ")

ERROR: Error: Table data exists in database, and both overwrite and append are FALSE

In [100]:
sqldf("select name,phy,chem,maths from data")

ERROR: Error: Table data exists in database, and both overwrite and append are FALSE